# üß† Taller 3 - SQL

Este taller est√° dise√±ado para que practiques consultas SQL usando `ipython-sql` y una base de datos sobre competencias de gimnasia r√≠tmica. A lo largo del taller, trabajar√°s con tablas que representan gimnastas, conjuntos, campeonatos, instrumentos y evaluaciones.

**Objetivos del taller:**
- Aprender a crear tablas con claves primarias y for√°neas.
- Insertar datos en una base SQLite.
- Realizar consultas b√°sicas y avanzadas con SQL.
- Aplicar funciones de agregaci√≥n y subconsultas.

### Esquema

Para esta actividad vamos a trabajar con el siguiente esquema:

- `Gimnastas(id_gim, nombre, fecha_nac, id_conj)`
- `Conjunto(id_conj, nombre conj)`
- `Instrumento(id_inst, nombre_inst)`
- `Campeonato(id_camp, nom_camp, fecha_camp)`
- `Tipo(id_tipo, nom_tipo)`
- `Presentacion(id_pres, id_gim, id_conj, id_inst, id_camp, id_tipo)`
- `Evaluacion(Pje_eje, Pje_Dif, Pje_art, id_pres)`

In [2]:
%load_ext sql
%sql sqlite:///gimnasia.db

**Ojo**: cada vez que anteponemos `%sql` es porque esa l√≠nea corresponde a un comando a SQL que va a la base de datos en la que estamos trabajando (en este caso `gimnasia.db`). Si queremos tener todo un bloque con instrucciones SQL tenemos que usar `%%sql` (habr√°n ejemplos de esto a lo largo del _notebook_).

### Crear tablas

Tu primera prueba ser√° crear una base de datos de acuerdo el esquema de arriba. La sintaxis para crear tablas en SQL es la siguiente (si est√°n trabajando desde el cliente, despu√©s de cada sentencia SQL debes poner un punto y coma `;`):

```SQL
CREATE TABLE <Nombre Tabla> (<atributo_1> tipo, ... , <attributo_N> tipo)
```

Por ejemplo, para crear las tablas de esta actividad el c√≥digo es el siguiente:

In [3]:

%%sql

DROP TABLE IF EXISTS Gimnastas;
DROP TABLE IF EXISTS Conjuntos;
DROP TABLE IF EXISTS Instrumentos;
DROP TABLE IF EXISTS Campeonatos;
DROP TABLE IF EXISTS Tipos;
DROP TABLE IF EXISTS Presentaciones;
DROP TABLE IF EXISTS Evaluaciones;

CREATE TABLE Conjuntos (
    id_conj INTEGER PRIMARY KEY,
    nombre_conj TEXT
);

CREATE TABLE Gimnastas (
    id_gim INTEGER PRIMARY KEY,
    nombre TEXT,
    fecha_nac TEXT,
    id_conj INTEGER,
    FOREIGN KEY (id_conj) REFERENCES Conjuntos(id_conj)
);

CREATE TABLE Instrumentos (
    id_inst INTEGER PRIMARY KEY,
    nombre_inst TEXT
);

CREATE TABLE Campeonatos (
    id_camp INTEGER PRIMARY KEY,
    nombre_camp TEXT,
    fecha_camp TEXT
);

CREATE TABLE Tipos (
    id_tipo INTEGER PRIMARY KEY,
    nombre_tipo TEXT
);

CREATE TABLE Presentaciones (
    id_pres INTEGER PRIMARY KEY,
    id_gim INTEGER,
    id_conj INTEGER,
    id_inst INTEGER,
    id_camp INTEGER,
    id_tipo INTEGER,
    FOREIGN KEY (id_gim) REFERENCES Gimnastas(id_gim),
    FOREIGN KEY (id_conj) REFERENCES Conjuntos(id_conj),
    FOREIGN KEY (id_inst) REFERENCES Instrumentos(id_inst),
    FOREIGN KEY (id_camp) REFERENCES Campeonatos(id_camp),
    FOREIGN KEY (id_tipo) REFERENCES Tipos(id_tipo)
);

CREATE TABLE Evaluaciones (
    id_pres INTEGER,
    pje_eje REAL,
    pje_dif REAL,
    pje_art REAL,
    PRIMARY KEY (id_pres, pje_eje, pje_art, pje_dif),
    FOREIGN KEY (id_pres) REFERENCES Presentaciones(id_pres)
);

 * sqlite:///gimnasia.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

En el c√≥digo anterior, tenemos tablas con llave primaria compuesta. En general, para crear una tabla con llave primaria, lo se√±alamos al final, de la forma:

```SQL
CREATE TABLE <Nombre Tabla> (
    <atributo_1> tipo, ...,
    <attributo_N> tipo,
    PRIMARY KEY(<atributos separados por coma (,)>))
```

Si la tabla tiene llaves for√°neas que hacen referencia a un campo de otra tabla, la sintaxis es la siguiente:

```SQL
CREATE TABLE <Nombre Tabla> (
    <atributo_1> tipo, ...,
    <attributo_N> tipo,
    PRIMARY KEY(<atributos separados por coma (,)>)
    FOREIGN KEY (atributo_X) REFERENCES TABLA(atributo_foraneo))
```

Si ejecutamos la consulta `SELECT * FROM Conjuntos` notaremos que el resultado es vac√≠o. Esto es evidente, ya que esta consulta me retorna todo lo que tengo en la tabla `Conjuntos` y actualmente no hemos insertado nada.

In [4]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql Select * from Conjuntos;

 * sqlite:///gimnasia.db
Done.

[]

### Innsertar Valores

Para insertar valores, la forma b√°sica es la siguiente:

```SQL
INSERT INTO <Nombre Tabla>
VALUES (<valor atributo 1> , ..., <valor atributo N>)
```

Por ejemplo si ejecutamos la consulta:

```SQL
INSERT INTO Conjuntos VALUES (1, 'Estrellas');
```

estamos insertando un Conjunto con `id_conj` 1 y `nombre_conj` Estrellas.

In [5]:
%sql INSERT INTO Conjuntos VALUES (1, 'Estrellas');

 * sqlite:///gimnasia.db
1 rows affected.

[]

Ahora que hemos insertado nuestro primer registro en la base de datos, podremos ejecutar nuevamente la consulta sobre la tabla `Conjuntos` y obtendremos un resultado distinto.

In [6]:
%sql Select * from Conjuntos;

 * sqlite:///gimnasia.db
Done.

[(1, 'Estrellas')]

A continuaci√≥n est√° el c√≥digo para poblar todas las tablas de la base de datos

In [7]:

%%sql

-- Insertar conjuntos
INSERT INTO Conjuntos VALUES (2, 'Fant√°sticas');
INSERT INTO Conjuntos VALUES (3, 'Auroras');

-- Insertar gimnastas
INSERT INTO Gimnastas VALUES (1, 'Ana Torres', '2005-03-12', 1);
INSERT INTO Gimnastas VALUES (2, 'Luc√≠a P√©rez', '2006-07-25', 1);
INSERT INTO Gimnastas VALUES (3, 'Mar√≠a G√≥mez', '2004-11-05', 2);

-- Insertar instrumentos
INSERT INTO Instrumentos VALUES (1, 'Cinta');
INSERT INTO Instrumentos VALUES (2, 'Aro');
INSERT INTO Instrumentos VALUES (3, 'Manos libres');

-- Insertar campeonatos
INSERT INTO Campeonatos VALUES (1, 'Campeonato Nacional', '2023-06-15');
INSERT INTO Campeonatos VALUES (2, 'Copa Primavera', '2023-09-10');
INSERT INTO Campeonatos VALUES (3, 'Copa Invierno', '2025-06-10');


-- Insertar tipos
INSERT INTO Tipos VALUES (1, 'Individual');
INSERT INTO Tipos VALUES (2, 'Conjunto');

-- Insertar presentaciones
INSERT INTO Presentaciones VALUES (1, 1, NULL, 1, 1, 1);
INSERT INTO Presentaciones VALUES (2, NULL, 1, 2, 1, 2);
INSERT INTO Presentaciones VALUES (3, 3, NULL, 3, 2, 1);

-- Insertar evaluaciones
INSERT INTO Evaluaciones VALUES (1, 8.5, 9.0, 8.8);
INSERT INTO Evaluaciones VALUES (2, 9.2, 8.7, 9.0);
INSERT INTO Evaluaciones VALUES (3, 7.8, 8.0, 8.5);

 * sqlite:///gimnasia.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Si intentamos ejecutar nuevamente el siguiente c√≥digo nuevamente, obtendremos un error. No es posible insertar 2 tuplas con la misma llave.

```SQL
INSERT INTO Conjuntos VALUES (1, 'Estrellas');
```

In [8]:
%sql INSERT INTO Conjuntos VALUES (1, 'Estrellas');

 * sqlite:///gimnasia.db
(sqlite3.IntegrityError) UNIQUE constraint failed: Conjuntos.id_conj
[SQL: INSERT INTO Conjuntos VALUES (1, 'Estrellas' );]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

### Ejecuci√≥n de Consultas

Las consultas m√°s b√°sicas son de la forma `SELECT - FROM - WHERE`. En general, la consulta de √°lgebra relacional:

$$
\pi_{a_1, \dots, a_n}(\sigma_{\text{condiciones}}(R_1 \times R_m))
$$

se traduce en SQL como:

```SQL
SELECT a_1, ..., a_n
FROM R_1, ..., R_m
WHERE <condiciones>
```
Prueba la siguiente consulta:

In [9]:
%%sql
Select *
From Gimnastas
Where id_gim = 1;

 * sqlite:///gimnasia.db
Done.

[(1, 'Ana Torres', '2005-03-12', 1)]

Para realizar un Join de tablas la sintaxis es
```SQL
SELECT a_1, ..., a_n
FROM R_1, ..., R_m
WHERE R_1.a_1 = R_j.aj;
```
Probemos ejecutando las siguientes consultas que obtiene la informaci√≥n de las gimnastas que pertenecen al conjunto **Estrellas**.

Se incluyen las sintaxis usando `Where` o usando `Join`

In [10]:
%%sql
Select *
From Gimnastas as G,
  Conjuntos as C
Where G.id_conj = C.id_conj
  And C.nombre_conj = 'Estrellas';

 * sqlite:///gimnasia.db
Done.

[(1, 'Ana Torres', '2005-03-12', 1, 1, 'Estrellas'),
 (2, 'Luc√≠a P√©rez', '2006-07-25', 1, 1, 'Estrellas')]

In [11]:
%%sql
Select *
From Gimnastas as G
  Join Conjuntos as C On G.id_conj = C.id_conj
Where C.nombre_conj = 'Estrellas';

 * sqlite:///gimnasia.db
Done.

[(1, 'Ana Torres', '2005-03-12', 1, 1, 'Estrellas'),
 (2, 'Luc√≠a P√©rez', '2006-07-25', 1, 1, 'Estrellas')]

## üèãÔ∏è Ejercicios

Responde los siguientes ejercicios usando consultas SQL.

**1.** Listar todos los campeonatos que se realizaron en el a√±o 2023.

In [18]:
%%sql
-- Soluci√≥n 1
select *
from campeonatos
where fecha_camp like '2023%';

 * sqlite:///gimnasia.db
Done.

[(1, 'Campeonato Nacional', '2023-06-15'), (2, 'Copa Primavera', '2023-09-10')]

In [16]:
%%sql
-- Soluci√≥n 2
select *
from campeonatos
where substr(fecha_camp, 1, 4) = '2023';

 * sqlite:///gimnasia.db
Done.

[(1, 'Campeonato Nacional', '2023-06-15'), (2, 'Copa Primavera', '2023-09-10')]

In [17]:
%%sql
-- Soluci√≥n 3
select *
from campeonatos
where date(fecha_camp) between '2023-01-01' and '2023-12-31';

 * sqlite:///gimnasia.db
Done.

[(1, 'Campeonato Nacional', '2023-06-15'), (2, 'Copa Primavera', '2023-09-10')]

**2.** Listar todas las gimnastas menores de 18 a√±os.

In [24]:
%%sql
-- Soluci√≥n 1 s√≥lo considerando a√±os

select *, date('now') - date(fecha_nac) as edad
from gimnastas
where date('now') - date(fecha_nac) < 18;

 * sqlite:///gimnasia.db
Done.

[]

In [23]:
%%sql
-- Soluci√≥n 2 considereando fecha de nacimiento completa
select *
from gimnastas
where julianday('now') - julianday(fecha_nac) < 18 * 365;

 * sqlite:///gimnasia.db
Done.

[]

**3.** Insertar los instrumentos `Bal√≥n` y `√Äro` en la tabla instrumentos

In [25]:
%%sql
insert into instrumentos values (4, 'Bal√≥n');
-- Aro existe ya existe en la tabla
insert into instrumentos values (5, 'Aro');

 * sqlite:///gimnasia.db
1 rows affected.
1 rows affected.

[]

**4.** Crear presentaciones `√åndividuales` con los instrumentos `Bal√≥n`y `√Äro`.

In [26]:
%%sql
insert into presentaciones values (4, 1, null, 4, 1, 1);
insert into presentaciones values (5, 1, null, 5, 1, 1);

 * sqlite:///gimnasia.db
1 rows affected.
1 rows affected.

[]

**5.** Crear presentaciones `Conjunto` con los instrumentos `Bal√≥n`y `√Äro`.

In [27]:
%%sql
insert into presentaciones values (6, null, 1, 4, 1, 2);
insert into presentaciones values (7, null, 1, 5, 1, 2);

 * sqlite:///gimnasia.db
1 rows affected.
1 rows affected.

[]

**6.** Listar todas las gimnastas con el nombre de su conjunto.

In [28]:
%%sql
select g.nombre, c.nombre_conj
from gimnastas as g
join conjuntos as c on g.id_conj = c.id_conj;

 * sqlite:///gimnasia.db
Done.

[('Ana Torres', 'Estrellas'),
 ('Luc√≠a P√©rez', 'Estrellas'),
 ('Mar√≠a G√≥mez', 'Fant√°sticas')]

**7.** Mostrar las presentaciones individuales con el nombre del instrumento y el puntaje art√≠stico.

In [29]:
%%sql
select p.id_pres, i.nombre_inst, e.pje_eje
from presentaciones as p
join instrumentos as i on p.id_inst = i.id_inst
join evaluaciones as e on p.id_pres = e.id_pres

 * sqlite:///gimnasia.db
Done.

[(1, 'Cinta', 8.5), (2, 'Aro', 9.2), (3, 'Manos libres', 7.8)]


**8.** Listar los nombres de los conjuntos que han participado en el 'Campeonato Nacional'.

In [30]:
%%sql
select distinct c.nombre_conj
from conjuntos as c
join presentaciones as p on c.id_conj = p.id_conj
join campeonatos as ca on p.id_camp = ca.id_camp
where ca.nombre_camp = 'Campeonato Nacional';

 * sqlite:///gimnasia.db
Done.

[('Estrellas',)]

**9.** Mostrar el nombre de la gimnasta con el mayor puntaje de dificultad.

In [31]:
%%sql
select g.nombre, max(e.pje_dif)
from gimnastas as g
join presentaciones as p on g.id_gim = p.id_gim
join evaluaciones as e on p.id_pres = e.id_pres

 * sqlite:///gimnasia.db
Done.

[('Ana Torres', 9.0)]

**10.** Contar cu√°ntas presentaciones se han realizado por cada instrumento.

In [32]:
%%sql
select i.nombre_inst, count(p.id_pres)
from instrumentos as i
left join presentaciones as p on i.id_inst = p.id_inst
group by i.nombre_inst;

 * sqlite:///gimnasia.db
Done.

[('Aro', 3), ('Bal√≥n', 2), ('Cinta', 1), ('Manos libres', 1)]

**11.** Listar los campeonatos en los que ha participado la gimnasta 'Ana Torres'.

In [34]:
%%sql
select distinct ca.nombre_camp
from campeonatos as ca
join presentaciones as p on ca.id_camp = p.id_camp
join gimnastas as g on p.id_gim = g.id_gim
where g.nombre = 'Ana Torres';

 * sqlite:///gimnasia.db
Done.

[('Campeonato Nacional',)]

**12.** Listar todas las presentaciones junto con el nombre del campeonato, tipo de presentaci√≥n y puntajes.

In [37]:
%%sql
select p.id_pres, ca.nombre_camp, t.nombre_tipo, e.pje_eje, e.pje_dif, e.pje_art
from presentaciones as p
join campeonatos as ca on p.id_camp = ca.id_camp
join tipos as t on p.id_tipo = t.id_tipo
join evaluaciones as e on p.id_pres = e.id_pres;

 * sqlite:///gimnasia.db
Done.

[(1, 'Campeonato Nacional', 'Individual', 8.5, 9.0, 8.8),
 (2, 'Campeonato Nacional', 'Conjunto', 9.2, 8.7, 9.0),
 (3, 'Copa Primavera', 'Individual', 7.8, 8.0, 8.5)]